## House Price Predictor

#### Life cycle of Machine learning Project

- Understanding the Problem Statement
- Data Collection
- Data Checks to perform
- Exploratory data analysis
- Data Pre-Processing
- Model Training
- Choose best model

### 1) Problem statement
- This project understands how the price of house  is affected by other variables such as no. of bedrooms, bathrooms, area in square feets,and otherproperties of the house.


### 2) Data Collection
- Dataset Source - https://www.kaggle.com/datasets/shree1992/housedata 
- The data consists of 17 column and 4550 rows.

### 2.1 Import Data and Required Packages
####  Importing Pandas, Numpy, Matplotlib, Seaborn and Warings Library.

In [4]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

#### Import the CSV Data as Pandas DataFrame

In [7]:
df = pd.read_csv('data.csv')

#### Show Top 5 Records

In [8]:
df.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,7800.0,2,1.00,780,16344,1.0,0,0,1,780,0,1942,0,4229 S 144th St,Tukwila,WA 98168,USA
1,80000.0,1,0.75,430,5050,1.0,0,0,2,430,0,1912,0,32215 E Rutherford St,Carnation,WA 98014,USA
2,83000.0,2,1.00,900,8580,1.0,0,0,3,900,0,1918,0,14440 51st Ave S,Tukwila,WA 98168,USA
3,83300.0,3,2.00,1490,7770,1.0,0,0,4,1490,0,1990,0,26017 189th Ave SE,Covington,WA 98042,USA
4,83300.0,3,2.00,1370,78408,1.0,0,0,5,1370,0,1964,0,24007 196th Ave SE,Covington,WA 98042,USA

#### Shape of the dataset

In [20]:
df.shape

(4550, 17)

### 2.2 Dataset information

- price - Price of the house
- bedrooms - No. of bedrooms
- bathrooms
- sqft_living
- sqft_lot
- floors
- waterfront
- condition 
- sqft_above
- sqft_basement
- yr_built
- yr_renovated	
- street	
- city	
- statezip	
- country

### 3. Data Checks to perform

- Check Missing values
- Check Duplicates
- Check data type
- Check the number of unique values of each column
- Check statistics of data set
- Check various categories present in the different categorical column

### 3.1 Check Missing values

In [10]:
df.isna().sum()

price            0
bedrooms         0
bathrooms        0
sqft_living      0
sqft_lot         0
floors           0
waterfront       0
view             0
condition        0
sqft_above       0
sqft_basement    0
yr_built         0
yr_renovated     0
street           0
city             0
statezip         0
country          0
dtype: int64

#### There are no missing values in the data set

### 3.2 Check Duplicates

In [11]:
df.duplicated().sum()

0

#### There are no duplicates  values in the data set

### 3.3 Check data types

In [12]:
# Check Null and Dtypes
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4550 entries, 0 to 4549
Data columns (total 17 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   price          4550 non-null   float64
 1   bedrooms       4550 non-null   int64
 2   bathrooms      4550 non-null   float64
 3   sqft_living    4550 non-null   int64
 4   sqft_lot       4550 non-null   int64
 5   floors         4550 non-null   float64
 6   waterfront     4550 non-null   int64
 7   view           4550 non-null   int64
 8   condition      4550 non-null   int64
 9   sqft_above     4550 non-null   int64
 10  sqft_basement  4550 non-null   int64
 11  yr_built       4550 non-null   int64
 12  yr_renovated   4550 non-null   int64
 13  street         4550 non-null   object
 14  city           4550 non-null   object
 15  statezip       4550 non-null   object
 16  country        4550 non-null   object
dtypes: float64(3), int64(10), object(4)
memory usage: 604.4+ KB

### 3.4 Checking the number of unique values of each column

In [13]:
df.nunique()

price            1739
bedrooms           10
bathrooms          26
sqft_living       561
sqft_lot         3086
floors              6
waterfront          2
view                5
condition           5
sqft_above        510
sqft_basement     207
yr_built          115
yr_renovated       59
street           4475
city               44
statezip           77
country             1
dtype: int64

### 3.5 Check statistics of data set

In [14]:
df.describe()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated
count,4.550000e+03,4550.000000,4550.000000,4550.000000,4.550000e+03,4550.000000,4550.000000,4550.000000,4550.000000,4550.000000,4550.000000,4550.000000,4550.000000
mean,5.521846e+05,3.394725,2.155055,2132.581538,1.483683e+04,1.512308,0.006593,0.234725,3.449231,1822.362857,310.218681,1970.790989,808.741758
std,4.111969e+05,0.904676,0.776433,955.950470,3.596788e+04,0.538537,0.080941,0.765449,0.675185,854.493736,462.015516,29.761683,979.455754
min,7.800000e+03,0.000000,0.000000,370.000000,6.380000e+02,1.000000,0.000000,0.000000,1.000000,370.000000,0.000000,1900.000000,0.000000
25%,3.261821e+05,3.000000,1.750000,1460.000000,5.000000e+03,1.000000,0.000000,0.000000,3.000000,1190.000000,0.000000,1951.000000,0.000000
50%,4.650000e+05,3.000000,2.250000,1970.000000,7.680000e+03,1.500000,0.000000,0.000000,3.000000,1590.000000,0.000000,1976.000000,0.000000
75%,6.575000e+05,4.000000,2.500000,2610.000000,1.098200e+04,2.000000,0.000000,0.000000,4.000000,2300.000000,600.000000,1997.000000,1999.000000
max,1.289900e+07,9.000000,8.000000,13540.000000,1.074218e+06,3.500000,1.000000,4.000000,5.000000,9410.000000,4820.000000,2014.000000,2014.000000

#### Insight
-

### 3.7 Exploring Data

In [16]:
df.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,7800.0,2,1.00,780,16344,1.0,0,0,1,780,0,1942,0,4229 S 144th St,Tukwila,WA 98168,USA
1,80000.0,1,0.75,430,5050,1.0,0,0,2,430,0,1912,0,32215 E Rutherford St,Carnation,WA 98014,USA
2,83000.0,2,1.00,900,8580,1.0,0,0,3,900,0,1918,0,14440 51st Ave S,Tukwila,WA 98168,USA
3,83300.0,3,2.00,1490,7770,1.0,0,0,4,1490,0,1990,0,26017 189th Ave SE,Covington,WA 98042,USA
4,83300.0,3,2.00,1370,78408,1.0,0,0,5,1370,0,1964,0,24007 196th Ave SE,Covington,WA 98042,USA

In [17]:
# define numerical & categorical columns
numeric_features = [feature for feature in df.columns if df[feature].dtype != 'O']
categorical_features = [feature for feature in df.columns if df[feature].dtype == 'O']

# print columns
print('We have {} numerical features : {}'.format(len(numeric_features), numeric_features))
print('\nWe have {} categorical features : {}'.format(len(categorical_features), categorical_features))

We have 13 numerical features : ['price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot', 'floors', 'waterfront', 'view', 'condition', 'sqft_above', 'sqft_basement', 'yr_built', 'yr_renovated']

We have 4 categorical features : ['street', 'city', 'statezip', 'country']

In [18]:
df.head(2)

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,7800.0,2,1.00,780,16344,1.0,0,0,1,780,0,1942,0,4229 S 144th St,Tukwila,WA 98168,USA
1,80000.0,1,0.75,430,5050,1.0,0,0,2,430,0,1912,0,32215 E Rutherford St,Carnation,WA 98014,USA